; domain
(define (domain assignment-environment)
    (:requirements :typing :equality :negative-preconditions :existential-preconditions)
    (:types
        loc - object
        person - object
        crate - object
        food medicine - crate
        robot - object
        carrier - object
        quantity - object
    )

    (:constants agent - robot)
    
    (:predicates
        ; localization predicates
        (robot-at ?r - robot ?l - loc)
        (person-at ?p - person ?l - loc)
        (crate-at ?k - crate ?l - loc)
        (carrier-at ?c - carrier ?l - loc) ; NOTE: assuming the carrier always moves alongside the agent, in this simple problem is redundant!
        
        ; action-based predicates
        (has-crate ?p - person ?k - crate) ; person p has crate c
        (carrying ?c - carrier ?k - crate) ; crate ?k is contained in carrier ?c

        ; predicates expressing intrinsic properties of entities
        (delivered ?k - crate) ; crate k has been delivered (cannot be loaded on a carrier)

        ; mathematical predicates in order to avoid numeric fluents
        (inc ?n ?another_number) ; should be true if n+1 = another_number
        (dec ?n ?another_number) ; should be true if n-1 = another_number
        (crates-amount ?c - carrier ?q - quantity) ; should be true if the carrier is holding 'quantity' crates
    )

    ; move the robot ?r from location ?src to location ?dst
    (:action Move
        :parameters (?r - robot ?c - carrier ?src ?dst - loc)
        :precondition (and
            ; actual action constraints
            (robot-at ?r ?src) (carrier-at ?c ?src) (not (= ?src ?dst))
        )
        :effect (and 
            (not (robot-at ?r ?src)) (not (carrier-at ?c ?src)) ; robot and carrier are not at the source location anymore
            (robot-at ?r ?dst) (carrier-at ?c ?dst); robot and carrier are at the destination location after moving
        )
    )

    ; load the ?end_q crate ?k onto carrier ?k which already has ?start_q crates with robot ?r at location ?l 
    (:action Load 
        :parameters (?r - robot ?c - carrier ?k - crate ?l - loc ?start_q ?end_q - quantity)
        :precondition (and 
            (robot-at ?r ?l) (crate-at ?k ?l) (carrier-at ?c ?l); location constraints
            (not (carrying ?c ?k)) ; ensure the carrier can load the crate
            (not (delivered ?k)) ; ensure the crate can be loaded onto the robot
            (inc ?start_q ?end_q) ; ensure this is satisfying the mathematical constraint src_q+1=dst_q
            (crates-amount ?c ?start_q) ; ensure the crate has exactly ?start_q crates before performing this action
        )
        :effect (and 
            (carrying ?c ?k) ; the carrier is actually holding the crate
            (crates-amount ?c ?end_q)
            (not (crates-amount ?c ?start_q))
        )
    )

    ; deliver the content of crate ?k to person ?p from robot ?r when at the same location ?l
    (:action Unload
        :parameters (?r - robot ?c - carrier ?k - crate ?p - person ?l - loc ?start_q ?end_q - quantity)
        :precondition (and 
            (robot-at ?r ?l) (person-at ?p ?l) (carrier-at ?c ?l); location constraints
            (carrying ?c ?k) ; make sure we are not trying to unload a crate we don't have!
            (dec ?start_q ?end_q)
            (crates-amount ?c ?start_q)
        )
        :effect (and 
            (not (carrying ?c ?k)) ; the robot is not carrying the crate anymore, so it is free
            (has-crate ?p ?k) (crate-at ?k ?l) ; the crate has been delivered to the person, so it is his/hers property at the same loc.
            (delivered ?k) ; since the person needs the content of the crate, it cannot be reused. So, mark it as delivered.
            (not (crates-amount ?c ?start_q))
            (crates-amount ?c ?end_q)
        )
    )
)

; problem
(define (problem problem_two) (:domain assignment-environment)
(:objects 
    ; let's suppose 11 random locations directly connected to each other
    depot l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - loc
    ; let's suppose 3 people 
    Alice Wamiq Zihadul Matteo Federico Gianmarco - person
    ; let's suppose 6 crates, 3 containing food and 3 containing medicine (subtypes of crate!)
    c0 c1 c2 - food
    c3 c4 c5 - medicine 
    ; unique carrier object
    carr - carrier
    ; define quantities between 0 to 4
    n0 n1 n2 n3 n4 - quantity
)

(:init
    ; let's suppose all People are in different locations
    (person-at Wamiq l0) (person-at Zihadul l5) (person-at Alice l8)
    (person-at Matteo l3) (person-at Federico l9) (person-at Gianmarco l7)
    
    ; every crate as well as the agent and the carrier are in the 'depot'
    (crate-at c0 depot) (crate-at c1 depot) (crate-at c2 depot) (crate-at c3 depot) (crate-at c4 depot) (crate-at c5 depot)
    (robot-at agent depot) (carrier-at carr depot)
    
    ; in closed-world assumptions, we must mark the carrier as free in the beginning (free = with 0 crates). Otherwise, it cannot pick crates!
    (crates-amount carr n0)

    ; then, let's define increment - decrement relationships among 'quantity' objects
    (inc n0 n1) (inc n1 n2) (inc n2 n3) (inc n3 n4)
    (dec n4 n3) (dec n3 n2) (dec n2 n1) (dec n1 n0)
)

(:goal (and
    ; random definition of what people need
    ; let's suppose Wamiq needs FOOD, while Zihadul and Alice need MEDICINE
    (exists (?c - food) (and (has-crate Wamiq ?c) ))
    (exists (?c - food) (and (has-crate Matteo ?c) ))
    (exists (?c - food) (and (has-crate Federico ?c) ))
    (exists (?c - medicine) (and (has-crate Zihadul ?c) ))
    (exists (?c - medicine) (and (has-crate Alice ?c) ))
    (exists (?c - medicine) (and (has-crate Gianmarco ?c) ))
))

)

; plan
1. (load agent carr c5 depot n0 n1)
   deleted: (crates-amount carr n0)
   added: (carrying carr c5) (crates-amount carr n1)
   goals met: 0 of 6
2. (load agent carr c0 depot n1 n2)
   deleted: (crates-amount carr n1)
   added: (carrying carr c0) (crates-amount carr n2)
   goals met: 0 of 6
3. (move agent carr depot l0)
   deleted: (robot-at agent depot) (carrier-at carr depot)
   added: (robot-at agent l0) (carrier-at carr l0)
   goals met: 0 of 6
4. (unload agent carr c0 wamiq l0 n2 n1)
   deleted: (carrying carr c0) (crates-amount carr n2)
   added: (has-crate wamiq c0) (crate-at c0 l0) (delivered c0) (crates-amount carr n1)
   goals met: 1 of 6
5. (move agent carr l0 depot)
   deleted: (robot-at agent l0) (carrier-at carr l0)
   added: (robot-at agent depot) (carrier-at carr depot)
   goals met: 1 of 6
6. (load agent carr c1 depot n1 n2)
   deleted: (crates-amount carr n1)
   added: (carrying carr c1) (crates-amount carr n2)
   goals met: 1 of 6
7. (move agent carr depot l3)
   deleted: (robot-at agent depot) (carrier-at carr depot)
   added: (robot-at agent l3) (carrier-at carr l3)
   goals met: 1 of 6
8. (unload agent carr c1 matteo l3 n2 n1)
   deleted: (carrying carr c1) (crates-amount carr n2)
   added: (has-crate matteo c1) (crate-at c1 l3) (delivered c1) (crates-amount carr n1)
   goals met: 2 of 6
9. (move agent carr l3 depot)
   deleted: (robot-at agent l3) (carrier-at carr l3)
   added: (robot-at agent depot) (carrier-at carr depot)
   goals met: 2 of 6
10. (load agent carr c2 depot n1 n2)
   deleted: (crates-amount carr n1)
   added: (carrying carr c2) (crates-amount carr n2)
   goals met: 2 of 6
11. (move agent carr depot l5)
   deleted: (robot-at agent depot) (carrier-at carr depot)
   added: (robot-at agent l5) (carrier-at carr l5)
   goals met: 2 of 6
12. (move agent carr l5 l9)
   deleted: (robot-at agent l5) (carrier-at carr l5)
   added: (robot-at agent l9) (carrier-at carr l9)
   goals met: 2 of 6
13. (unload agent carr c2 federico l9 n2 n1)
   deleted: (carrying carr c2) (crates-amount carr n2)
   added: (has-crate federico c2) (crate-at c2 l9) (delivered c2) (crates-amount carr n1)
   goals met: 3 of 6
14. (move agent carr l9 l5)
   deleted: (robot-at agent l9) (carrier-at carr l9)
   added: (robot-at agent l5) (carrier-at carr l5)
   goals met: 3 of 6
15. (unload agent carr c5 zihadul l5 n1 n0)
   deleted: (carrying carr c5) (crates-amount carr n1)
   added: (has-crate zihadul c5) (crate-at c5 l5) (delivered c5) (crates-amount carr n0)
   goals met: 4 of 6
16. (move agent carr l5 depot)
   deleted: (robot-at agent l5) (carrier-at carr l5)
   added: (robot-at agent depot) (carrier-at carr depot)
   goals met: 4 of 6
17. (load agent carr c3 depot n0 n1)
   deleted: (crates-amount carr n0)
   added: (carrying carr c3) (crates-amount carr n1)
   goals met: 4 of 6
18. (move agent carr depot l7)
   deleted: (robot-at agent depot) (carrier-at carr depot)
   added: (robot-at agent l7) (carrier-at carr l7)
   goals met: 4 of 6
19. (unload agent carr c3 gianmarco l7 n1 n0)
   deleted: (carrying carr c3) (crates-amount carr n1)
   added: (has-crate gianmarco c3) (crate-at c3 l7) (delivered c3) (crates-amount carr n0)
   goals met: 5 of 6
20. (move agent carr l7 depot)
   deleted: (robot-at agent l7) (carrier-at carr l7)
   added: (robot-at agent depot) (carrier-at carr depot)
   goals met: 5 of 6
21. (load agent carr c4 depot n0 n1)
   deleted: (crates-amount carr n0)
   added: (carrying carr c4) (crates-amount carr n1)
   goals met: 5 of 6
22. (move agent carr depot l8)
   deleted: (robot-at agent depot) (carrier-at carr depot)
   added: (robot-at agent l8) (carrier-at carr l8)
   goals met: 5 of 6
23. (unload agent carr c4 alice l8 n1 n0)
   deleted: (carrying carr c4) (crates-amount carr n1)
   added: (has-crate alice c4) (crate-at c4 l8) (delivered c4) (crates-amount carr n0)
   goals met: 6 of 6
